tutorials/pureDEM/HFDIBDEMFoam/prescribedDiscWithCyclicBoundary/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    "(U)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0.05;
    }
    "(U)Final"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    15;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    //~ consistent         yes;
    consistent         no;
    
    outerCorrectorResidualControl
    {
        U
        {
            tolerance    1e-5;
            relTol        0;
        }
        p
        {
            tolerance    5e-4;
            relTol        0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p           0.8;
        //~ omega       0.5;
        //~ k           0.5;
        
        pFinal      1;
        //~ omegaFinal  1;
        //~ kFinal      1;
    }
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
